neosoultech/bioimpedance_msp430_test/main.c
                                // Overview
// Test code for a wearable, phone-powered bio-impedance patch sensor powered by energy harvesting.
// Parts include ST25DV-04K (NFC chip), MSP430FR2433 (MCU), and MAX30002 (Bio-impedance Sensor)
// Code is WIP, all tests are modular and not meant to be run at same time.
// MAX30002 communicates via SPI with MCU, while ST25 utilizes I2C.

                                // MAX30002 Information
// SPI interface
// ACLK (clock speed) at ~32KHz REFO
// - Data flow: BioZ measurement --> sample placed into FIFO --> FIFO reaches threshold --> INTB goes low on P2.1 falling edge
// --> PORT2 ISR --> max_flag = 1 --> main loop detects max_flag --> MCU reads STATUS --> MCU drains FIFO --> MCU parses bioZ data
// Note: FCLK must be present or no data generated, FIFO must be drained to prevent overflow, data interrupt-driven
// For eval board (MAX30001EVSYS), a 32kHz crystal oscillator is already provided, so FCLK on MSP is disabled.

// MAX30002 FIFO FORMAT:
// 24 bit word: bits [23:4] are 20-bit signed BioZ sample (2SC), bit [3]: zero padding, bits [2:0]: BTAG status tag
// BTAG: 000 valid, 001 over/under range, 010 valid EOF, 011 over/under EOF
// Note: Extract bits [23:4], mask 20 bits, and sign extend bit 19.


                                // ST25 Information
// I2C interface
// - Data flow: Phone tap --> ST25 asserts GPO on P2.0 falling edge --> PORT2 ISR --> phone_flag = 1 --> main loop detects phone_flag
// --> MCU reads/writes mailbox or EEPROM --> data transmitted to/from phone.
// Note: GPO requires pull-up resistor, mailbox must be enabled before use
//
// ST25 MAILBOX FORMAT:
// I2C mailbox message write must be one sequential write starting at 0x2008:
// [addr_MSB = 0x20][addr_LSB = 0x08][data0][data1]...[dataN]
// ST25DV automatically updates mailbox length/status after a successful message write.


                            // MSP430 Information
// CPU clock: 1MHz (SMCLK)
// Timing assumptions based on 1MHz: __delay_cycles(x) --> x cycles = x microseconds
// Peripheral timings: I2C clock and SPI clock = 100KHz (UCBOBRW and UCAOBRW)
//


                            //PREEXISTING WIRING (ST25)
//  P1.0: LED (status/debug indicator)
//  P1.2: SDA (serial data wire for I2C)
//  P1.3: SCL (clock wire for I2C)
//  P2.0: GPO (ST25 GPO input. Sets phone_flag)

                            //PREEXISTING WIRING (MAX)
//  P1.4: MOSI (master to slave data line)
//  P1.5: MISO (slave to master data line)
//  P1.6: SCLK (clock wire for SPI)
//  P1.7: CS (Chip select to initiate comms)
//  P2.1: INTB (FIFO/data-ready interrupt. Sets max_flag)
//  P2.2: FCLK (clock output ~32KHz ACLK to MAX30002)
//  P2.7: MUX_SEL on custom patch PCB only. Controls ADG884 target/reference mux.
//        Not used in TEST_MAX_2SPOT_MANUAL eval-board workflow.


                            // LED Notes:
// LED pulses once if transmission occurs successfully.
// LED blinks on and off if measurement is occurring.
// LED stays solid if error
// LED is off if IDLE/SLEEP.

#include <msp430.h>
#include <stdint.h>
#include <stdio.h>
#define USE_LPM              0 // 0 = Normal (debug), 1 = low power
#define BIOZ_LOG_N 128
                                // INTERRUPT HANDLER
// external interrupts from P2.0 (ST25 GPO): Indicates phone interaction, sets phone_flag
// external interrupts from P2.1 (MAX30002 INTB): Indicates data ready / FIFO event, sets max_flag
volatile int32_t debug_bioz = 0; // debugging
volatile uint32_t sample_count = 0; // debugging
volatile int32_t debug_target_bioz = 0;
volatile int32_t bioz_log_value[BIOZ_LOG_N] = {0};
volatile uint16_t bioz_log_i = 0;
volatile uint8_t bioz_log_done = 0;
volatile int32_t debug_print_count = 0;
volatile int32_t debug_baseline_bioz = 0;
volatile int32_t debug_bioz_diff = 0;
volatile uint32_t debug_info = 0;
volatile uint32_t debug_en_int_read = 0;
volatile uint8_t debug_config_pass = 0;
volatile uint32_t debug_en_int_start = 0;
volatile uint32_t debug_mngr_int_start = 0;
volatile uint32_t debug_gen_start = 0;
volatile uint32_t debug_bmux_start = 0;
volatile uint32_t debug_bioz_start = 0;
volatile uint8_t debug_start_pass = 0;
volatile uint32_t debug_bovf_count = 0;

volatile int phone_flag = 0;
volatile int max_flag = 0;
#pragma vector=PORT2_VECTOR
__interrupt void Port_2_ISR(void)
{
    if (P2IFG & BIT0) { // if GPO interrupt occurs on P2.0
        phone_flag = 1; // enable phone flag
        P2IFG &= ~BIT0; // clear interrupt flag
    }

    if (P2IFG & BIT1) { // if INTB interrupt occurs on P2.1
        max_flag = 1; // enable max flag
        P2IFG &= ~BIT1; // clear interrupt flag
    }
#if USE_LPM
    __bic_SR_register_on_exit(LPM0_bits); // exiting LPM upon interrupt
#endif
}
                                            //

                            // MAX30002 REGISTER MAP //
// MAX30002 config bit masks
#define MAX_REG_STATUS      0x01
#define MAX_REG_EN_INT      0x02
#define MAX_REG_EN_INT2     0x03
#define MAX_REG_MNGR_INT    0x04
#define MAX_REG_MNGR_DYN    0x05
#define MAX_REG_SW_RST      0x08
#define MAX_REG_SYNCH       0x09
#define MAX_REG_FIFO_RST    0x0A
#define MAX_REG_INFO        0x0F
#define MAX_REG_CNFG_GEN    0x10
#define MAX_REG_CNFG_BMUX   0x17
#define MAX_REG_CNFG_BIOZ   0x18
#define MAX_REG_FIFO_BURST  0x22
#define MAX_REG_FIFO        0x23

//STATUS
#define MAX_STATUS_BINT   (1UL << 19)  // BioZ FIFO interrupt
#define MAX_STATUS_BOVF   (1UL << 18)

// EN_INT bits
#define MAX_EN_INT_BINT     (1UL << 19) // enable BIOZ FIFO interrupt on external INTB pin
#define MAX_EN_INT_BOVF     (1UL << 18) // enable BIOZ FIFO overflow interrupt on INTB pin
#define MAX_INTB_DISABLED        0x000000 // D[1:0] = 00
#define MAX_INTB_CMOS            0x000001 // D[1:0] = 01
#define MAX_INTB_OPEN_DRAIN      0x000002 // D[1:0] = 10
#define MAX_INTB_OD_PULLUP       0x000003 // D[1:0] = 11 --> 125k pullup, default
#define MAX_CFG_EN_INT_START  (MAX_EN_INT_BINT | MAX_EN_INT_BOVF | MAX_INTB_OPEN_DRAIN) // EN_INT starting settings

    // CNFG_GEN
#define MAX_CNFG_GEN_EN_BIOZ     (1UL << 18) // enable BioZ channel
#define MAX_CNFG_GEN_EN_RBIAS    (2UL << 4)  // EN_RBIAS[1:0] = 10, BioZ resistive bias enabled
#define MAX_CNFG_GEN_RBIASV_100M (1UL << 2)  // RBIASV[1:0] = 01, 100M ohm bias
#define MAX_CNFG_GEN_RBIASP      (1UL << 1)  // enable bias on BIP
#define MAX_CNFG_GEN_RBIASN      (1UL << 0)  // enable bias on BIN
// CNFG_GEN starting settings for BIOZ, RBIAS, 100M, RBIASP, and RBIASN //
#define MAX_CFG_CNFG_GEN_START   (MAX_CNFG_GEN_EN_BIOZ      | \
                                   MAX_CNFG_GEN_EN_RBIAS    | \
                                   MAX_CNFG_GEN_RBIASV_100M | \
                                   MAX_CNFG_GEN_RBIASP      | \
                                   MAX_CNFG_GEN_RBIASN)
    // CNFG_BMUX
#define MAX_BMUX_OPENP_BIT        (1UL << 21) // bit is 1 when BIP isolated
#define MAX_BMUX_OPENN_BIT        (1UL << 20) // bit is 1 when BIN isolated

    // MNGR_INT
#define MAX_MNGR_INT_CLR_SAMP    (1UL << 2) // self clear SAMP interrupt after 1/4 data rate cycle
#define MAX_MNGR_INT_BFIT_1_SAMP (0UL << 16) // interrupt at 1 unread FIFO sample
#define MAX_CFG_MNGR_INT_START   (MAX_MNGR_INT_BFIT_1_SAMP | MAX_MNGR_INT_CLR_SAMP) // MNGR start settings

