neosoultech/bioimpedance_msp430_test/main.c
        return data;
    }

int enable_mailbox (void) { // helper function to enable FTM mailbox
     uint8_t mb_mode;

     if (!st25dv_present_i2c_password()) { // sending default, all zero password
             return 0;
         }
     if (!st25dv_i2c_session_is_open()) { // confirm I2C security session opened
             return 0;
         }
     if (!st25dv_write(ST25DV_ADDR_USER, ST25DV_REG_MB_CTRL_DYN, 0x00)) { // Disable dynamic FTM before changing static system config. This is harmless if FTM is already disabled.
         return 0;
     }
     mb_mode = st25dv_read(ST25DV_ADDR_SYSTEM, ST25DV_REG_MB_MODE); // Read static MB_MODE register
     if ((mb_mode & ST25DV_MB_MODE_ENABLE) == 0) { // if FTM auth not enabled, enable it.
             mb_mode |= ST25DV_MB_MODE_ENABLE; // set MB_MODE bit to allow Fast Transfer Mode/mailbox use
             if (!st25dv_write(ST25DV_ADDR_SYSTEM, ST25DV_REG_MB_MODE, mb_mode)) { // writing FTM enable
                         return 0;
                     }
             __delay_cycles(10000);
                }
                if (!st25dv_write(ST25DV_ADDR_USER,                 // Enable FTM dynamically for runtime mailbox use.
                                  ST25DV_REG_MB_CTRL_DYN,
                                  ST25DV_MB_CTRL_MB_EN)) {
                    return 0;
                }
                    return 1;
}

int st25dv_mailbox_is_free(void) {
    uint8_t ctrl;
    ctrl = st25dv_read(ST25DV_ADDR_USER, ST25DV_REG_MB_CTRL_DYN); // read MB_CTRL_DYN to see if MB free
    if ((ctrl & ST25DV_MB_CTRL_MB_EN) == 0) { // MB must be enabled
        return 0;
    }
    if (ctrl & ST25DV_MB_CTRL_HOST_PUT_MSG) { // if host put something in mailbox
        return 0;
    }
    if (ctrl & ST25DV_MB_CTRL_RF_PUT_MSG) { // if slave put something in mailbox
        return 0;
    }
    return 1; // mailbox is free
}

int mailbox_write(uint8_t *message, unsigned int length) { // write message bytes into ST25DV mailbox buffer
    if (message == 0) { // null pointer check, not checking message contents
        return 0;
    }
    if (length == 0 || length > ST25DV_MAILBOX_MAX_LEN) { // if overflow or empty
        return 0;
    }
    if (!st25dv_mailbox_is_free()) { // check to see if mailbox free
        return 0;
    }
    return st25dv_write_sequence(ST25DV_ADDR_USER, ST25DV_MAILBOX_BASE, message, length); // write to mailbox if free. Sending whole message as one sequential write.
    }

// SPI/MAX30002
void spi_pins_init(void) {
    P1SEL0 |= BIT4 | BIT5 | BIT6; // to select SPI, SEL0 needs to have bits 4,5,6 as 1.
    P1SEL1 &= ~(BIT4 | BIT5 | BIT6); // to select SPI, SEL1 needs to have bits
    P1DIR |= BIT7; // bit 7 is output (chip select)
    MAX_CS_HIGH(); // deselect MAX30002 to prevent accidental SPI commands during startup
}

void spi_init(void) { // clock idle low
    UCA0CTLW0 = UCSWRST; // completely reset SPI
    UCA0CTLW0 |= UCMODE_0 | // enabling SPI mode
                 UCSYNC   | // synchronous mode
                 UCMST    | // master mode
                 UCMSB    | // MSB 1st
                 UCCKPH   | // data captured on 1st clock edge, changed at following edge. Data sampled on rising edge.
                 UCSSEL__SMCLK; // enable clock

    UCA0BRW = 10; // clock speed set to 100kHz
    UCA0CTLW0 &= ~UCSWRST;   // begin SPI
}

void max_int_init() {
    P2DIR &= ~BIT1; // set P2.1 as interrupt input from MAX30002
    P2REN |= BIT1; // turn on internal resistor
    P2OUT |= BIT1; // enable pull-up

    P2IES |= BIT1; // detect interrupt on falling edge (1 to 0)
    P2IFG &= ~BIT1; // clear stale interrupt flag
    P2IE |= BIT1; // enable P2.1 interrupt

    if (!(P2IN & BIT1)) { // if P2.1 reads as 0, INTB is alr active, so set max_flag manually
            max_flag = 1;
        }

}

void fclk_init(void) { // helper function to set up ACLK between MCU and MAX30002
    CSCTL4 |= SELA__REFOCLK; // set ACLK source to REFO (~32 KHz)

    P2DIR |= BIT2; // 2.2 becomes output
    P2SEL0 &= ~BIT2; // setting P2SEL0.2 value to 0
    P2SEL1 |= BIT2; // P2SEL1.2 value set to 1. Both of these lines make (Sel1,Sel0) as (1,0) to select ACLK output
}

uint8_t spi_transfer(uint8_t data) { // helper function to transfer over SPI (both ways at same time)
    while (!(UCA0IFG & UCTXIFG)); // wait until TX buffer ready
    UCA0TXBUF = data; // put data into TX buffer
    while (!(UCA0IFG & UCRXIFG)); // while no RX interrupts
    return UCA0RXBUF; // get information coming into RX buffer
}

void bioz_mux_init(void) { // helper function to choose between ADG884 pins. P2.7 is BIOZ_MUX_SEL output
    P2SEL0 &= ~BIOZ_MUX_SEL_BIT; // GPIO MODE
    P2SEL1 &= ~BIOZ_MUX_SEL_BIT; // GPIO MODE
    BIOZ_SELECT_TARGET(); // default to target electrodes
    P2DIR |= BIOZ_MUX_SEL_BIT; // make P2.7 output
    P2REN &= ~BIOZ_MUX_SEL_BIT; // disable internal pull resistor
    P2IE &= ~BIOZ_MUX_SEL_BIT; // no interrupt on mux sel pin
    P2IFG &= ~BIOZ_MUX_SEL_BIT; // clear any stale flags
}

uint32_t max30002_read_reg(uint8_t reg) { // helper function to read data from a register from max30002
    uint32_t data = 0;
    MAX_CS_LOW(); // enable MAX30002
    spi_transfer(((reg & 0x7F) << 1) | 0x01); // Send command byte. Format is 7 bit address + R/W indicator
    data |= ((uint32_t)spi_transfer(0x00) << 16); // getting top data byte
    data |= ((uint32_t)spi_transfer(0x00) << 8); // getting middle data byte
    data |= ((uint32_t)spi_transfer(0x00)); // getting bottom data byte
    MAX_CS_HIGH(); // disable MAX30002

    return data; // what we read from register 'reg'
}

void max30002_write_reg(uint8_t reg, uint32_t data) { // Helper function to write to MAX30002 reg
    MAX_CS_LOW(); // enable MAX30002
    spi_transfer(((reg & 0x7F) << 1) | 0x00); // Send command byte. Same as before, but 0 LSB for write
    spi_transfer((data >> 16) & 0xFF); // top byte of data
    spi_transfer((data >> 8) & 0xFF); // middle byte of data
    spi_transfer((data) & 0xFF); // bottom byte of data
    MAX_CS_HIGH(); // disable MAX30002
}

