neosoultech/bioimpedance_msp430_test/main.c
    diff = avg1 - avg2; // compare first settled block to second settled block
    if (diff < 0) {
        diff = -diff; // take ||
    }

    if (diff > BIOZ_BLOCK_MISMATCH_LIMIT) { // first block likely still settling or contact artifact if difference is over 500
        return avg2; // use later block only
    }

    return (avg1 + avg2) / 2; // blocks agree, use both
}

// LED STATUS INDICATORS
void led_blink_measuring (void) { // blinking LED = measurement
    LED_TOGGLE();
    __delay_cycles (200000); // 0.2 seconds at 1MHz
}
void led_pulse_transmission (void) { // short pulse = successful event
    LED_ON();
    __delay_cycles(300000); // 0.3 second pulse
    LED_OFF();
}
void led_idle(void) { // LED off = idle/sleeping
    LED_OFF();
}
void error_handler (void) { // ensures LED is solid during error
    LED_ON();

    while(1); // LED stays permanently on with error
}

// EXP430 buttons
void button_s1_init(void) { // helper function to initialize buttons on EXP430FR2433 dev kit
    // S1 = P2.3
    // active-low buttons w/ internal pullups

    P2SEL0 &= ~(BUTTON_S1_BIT); // GPIO mode
    P2SEL1 &= ~(BUTTON_S1_BIT); // GPIO mode
    P2DIR &= ~(BUTTON_S1_BIT); // // S1 as input
    P2REN |= (BUTTON_S1_BIT); // turn on resistors
    P2OUT |= (BUTTON_S1_BIT); // turn on pullups
    P2IE &= ~(BUTTON_S1_BIT); // turn off hardware interrupts
    P2IFG &= ~(BUTTON_S1_BIT); // clear any interrupt flags
}
void wait_for_s1_press(void) { // blocks execution until button S1 fully pressed & released
    while (P2IN & BUTTON_S1_BIT); // BUTTON_S1_BIT is 0 if pressed
    __delay_cycles(50000); // 50ms debounce
    while (!(P2IN & BUTTON_S1_BIT));
    __delay_cycles(50000);
}
